zephyrproject-rtos/hal_silabs/si32/si32Hal/sim3l1xx/SI32_SIM3L1XX_DMAXBAR_A_Registers.h
#define SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_MASK  0x00F00000
#define SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_SHIFT  20
// Service DTM1 B data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_DTM1_B_VALUE  0
#define SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_DTM1_B_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_DTM1_B_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_SHIFT)
// Service DTM2 D data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_DTM2_D_VALUE  1
#define SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_DTM2_D_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_DTM2_D_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_SHIFT)
// Service SPI0 RX data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_SPI0_RX_VALUE  2
#define SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_SPI0_RX_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_SPI0_RX_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_SHIFT)
// Service AES0 RX data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_AES0_RX_VALUE  3
#define SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_AES0_RX_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_AES0_RX_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_SHIFT)
// Service USART0 RX data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_USART0_RX_VALUE  4
#define SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_USART0_RX_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_USART0_RX_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_SHIFT)
// Service I2C0 RX data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_I2C0_RX_VALUE  5
#define SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_I2C0_RX_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_I2C0_RX_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_SHIFT)
// Service IDAC0 data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_IDAC0_VALUE  6
#define SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_IDAC0_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_IDAC0_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_SHIFT)
// Service EPCA0 control data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_EPCA0_CONTROL_VALUE  7
#define SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_EPCA0_CONTROL_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_EPCA0_CONTROL_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_SHIFT)
// Service TIMER1L overflow data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_TIMER1L_VALUE  8
#define SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_TIMER1L_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_TIMER1L_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_SHIFT)
// Service TIMER1H overflow data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_TIMER1H_VALUE  9
#define SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_TIMER1H_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_TIMER1H_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_SHIFT)
// Service DMA0T1 rising edge data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_DMA0T1_RISE_VALUE  10
#define SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_DMA0T1_RISE_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_DMA0T1_RISE_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_SHIFT)
// Service DMA0T1 falling edge data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_DMA0T1_FALL_VALUE  11
#define SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_DMA0T1_FALL_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_DMA0T1_FALL_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_SHIFT)
// Unassigned.
#define SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_UNASSIGNED_VALUE  15
#define SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_UNASSIGNED_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_UNASSIGNED_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH5SEL_SHIFT)

#define SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_MASK  0x0F000000
#define SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_SHIFT  24
// Service DTM1 C data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_DTM1_C_VALUE  0
#define SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_DTM1_C_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_DTM1_C_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_SHIFT)
// Service DTM2 A data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_DTM2_A_VALUE  1
#define SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_DTM2_A_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_DTM2_A_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_SHIFT)
// Service ENCDEC0 TX data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_ENCDEC0_TX_VALUE  2
#define SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_ENCDEC0_TX_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_ENCDEC0_TX_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_SHIFT)
// Service AES0 XOR data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_AES0_XOR_VALUE  3
#define SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_AES0_XOR_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_AES0_XOR_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_SHIFT)
// Service USART0 TX data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_USART0_TX_VALUE  4
#define SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_USART0_TX_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_USART0_TX_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_SHIFT)
// Service I2C0 RX data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_I2C0_RX_VALUE  5
#define SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_I2C0_RX_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_I2C0_RX_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_SHIFT)
// Service I2C0 TX data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_I2C0_TX_VALUE  6
#define SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_I2C0_TX_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_I2C0_TX_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_SHIFT)
// Service SARADC0 data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_SARADC0_VALUE  7
#define SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_SARADC0_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_SARADC0_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_SHIFT)
// Service TIMER0L overflow data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_TIMER0L_VALUE  8
#define SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_TIMER0L_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_TIMER0L_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_SHIFT)
// Service TIMER0H overflow data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_TIMER0H_VALUE  9
#define SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_TIMER0H_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_TIMER0H_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_SHIFT)
// Service DMA0T0 rising edge data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_DMA0T0_RISE_VALUE  10
#define SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_DMA0T0_RISE_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_DMA0T0_RISE_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_SHIFT)
// Service DMA0T0 falling edge data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_DMA0T0_FALL_VALUE  11
#define SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_DMA0T0_FALL_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_DMA0T0_FALL_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_SHIFT)
// Unassigned.
#define SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_UNASSIGNED_VALUE  15
#define SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_UNASSIGNED_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_UNASSIGNED_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH6SEL_SHIFT)

#define SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_MASK  0xF0000000
#define SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_SHIFT  28
// Service DTM1 D data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_DTM1_D_VALUE  0U
#define SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_DTM1_D_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_DTM1_D_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_SHIFT)
// Service DTM2 B data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_DTM2_B_VALUE  1U
#define SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_DTM2_B_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_DTM2_B_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_SHIFT)
// Service ENCDEC0 RX data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_ENCDEC0_RX_VALUE  2U
#define SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_ENCDEC0_RX_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_ENCDEC0_RX_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_SHIFT)
// Service SPI1 TX data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_SPI1_TX_VALUE  3U
#define SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_SPI1_TX_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_SPI1_TX_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_SHIFT)
// Service USART0 RX data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_USART0_RX_VALUE  4U
#define SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_USART0_RX_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_USART0_RX_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_SHIFT)
// Service IDAC0 data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_IDAC0_VALUE  5U
#define SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_IDAC0_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_IDAC0_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_SHIFT)
// Service TIMER1L overflow data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_TIMER1L_VALUE  6U
#define SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_TIMER1L_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_TIMER1L_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_SHIFT)
// Service TIMER1H overflow data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_TIMER1H_VALUE  7U
#define SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_TIMER1H_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_TIMER1H_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_SHIFT)
// Service DMA0T1 rising edge data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_DMA0T1_RISE_VALUE  8U
#define SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_DMA0T1_RISE_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_DMA0T1_RISE_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_SHIFT)
// Service DMA0T1 falling edge data requests.
#define SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_DMA0T1_FALL_VALUE  9U
#define SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_DMA0T1_FALL_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_DMA0T1_FALL_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_SHIFT)
// Unassigned.
#define SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_UNASSIGNED_VALUE  15U
#define SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_UNASSIGNED_U32 \
   (SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_UNASSIGNED_VALUE << SI32_DMAXBAR_A_DMAXBAR0_CH7SEL_SHIFT)



