zephyrproject-rtos/hal_silabs/si32/si32Hal/sim3l1xx/SI32_SIM3L1XX_DMAXBAR_A_Registers.h
struct SI32_DMAXBAR_A_DMAXBAR1_Struct
{
   union
   {
      struct
      {
         // DMA Channel 8 Peripheral Select
         volatile uint32_t CH8SEL: 4;
         // DMA Channel 9 Peripheral Select
         volatile uint32_t CH9SEL: 4;
                  uint32_t reserved0: 24;
      };
      volatile uint32_t U32;
   };
};

#define SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_MASK  0x0000000F
#define SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_SHIFT  0
// Service DTM2 C data requests.
#define SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_DTM2_C_VALUE  0
#define SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_DTM2_C_U32 \
   (SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_DTM2_C_VALUE << SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_SHIFT)
// Service SPI0 TX data requests.
#define SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_SPI0_TX_VALUE  1
#define SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_SPI0_TX_U32 \
   (SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_SPI0_TX_VALUE << SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_SHIFT)
// Service SPI1 RX data requests.
#define SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_SPI1_RX_VALUE  2
#define SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_SPI1_RX_U32 \
   (SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_SPI1_RX_VALUE << SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_SHIFT)
// Service USART0 TX data requests.
#define SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_USART0_TX_VALUE  3
#define SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_USART0_TX_U32 \
   (SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_USART0_TX_VALUE << SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_SHIFT)
// Service I2C0 RX data requests.
#define SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_I2C0_RX_VALUE  4
#define SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_I2C0_RX_U32 \
   (SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_I2C0_RX_VALUE << SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_SHIFT)
// Service SARADC0 data requests.
#define SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_SARADC0_VALUE  5
#define SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_SARADC0_U32 \
   (SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_SARADC0_VALUE << SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_SHIFT)
// Service EPCA0 capture data requests.
#define SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_EPCA0_CAPTURE_VALUE  6
#define SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_EPCA0_CAPTURE_U32 \
   (SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_EPCA0_CAPTURE_VALUE << SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_SHIFT)
// Service TIMER0L overflow data requests.
#define SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_TIMER0L_VALUE  7
#define SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_TIMER0L_U32 \
   (SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_TIMER0L_VALUE << SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_SHIFT)
// Service TIMER0H overflow data requests.
#define SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_TIMER0H_VALUE  8
#define SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_TIMER0H_U32 \
   (SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_TIMER0H_VALUE << SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_SHIFT)
// Service DMA0T0 rising edge data requests.
#define SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_DMA0T0_RISE_VALUE  9
#define SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_DMA0T0_RISE_U32 \
   (SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_DMA0T0_RISE_VALUE << SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_SHIFT)
// Service DMA0T0 falling edge data requests.
#define SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_DMA0T0_FALL_VALUE  10
#define SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_DMA0T0_FALL_U32 \
   (SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_DMA0T0_FALL_VALUE << SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_SHIFT)
// Unassigned.
#define SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_UNASSIGNED_VALUE  15
#define SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_UNASSIGNED_U32 \
   (SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_UNASSIGNED_VALUE << SI32_DMAXBAR_A_DMAXBAR1_CH8SEL_SHIFT)

#define SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_MASK  0x000000F0
#define SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_SHIFT  4
// Service DTM2 D data requests.
#define SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_DTM2_D_VALUE  0
#define SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_DTM2_D_U32 \
   (SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_DTM2_D_VALUE << SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_SHIFT)
// Service SPI0 TX data requests.
#define SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_SPI0_RX_VALUE  1
#define SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_SPI0_RX_U32 \
   (SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_SPI0_RX_VALUE << SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_SHIFT)
// Service I2C0 RX data requests.
#define SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_I2C0_RX_VALUE  2
#define SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_I2C0_RX_U32 \
   (SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_I2C0_RX_VALUE << SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_SHIFT)
// Service I2C0 TX data requests.
#define SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_I2C0_TX_VALUE  3
#define SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_I2C0_TX_U32 \
   (SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_I2C0_TX_VALUE << SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_SHIFT)
// Service IDAC0 data requests.
#define SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_IDAC0_VALUE  4
#define SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_IDAC0_U32 \
   (SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_IDAC0_VALUE << SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_SHIFT)
// Service EPCA0 capture data requests.
#define SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_EPCA0_CAPTURE_VALUE  5
#define SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_EPCA0_CAPTURE_U32 \
   (SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_EPCA0_CAPTURE_VALUE << SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_SHIFT)
// Service EPCA0 control data requests.
#define SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_EPCA0_CONTROL_VALUE  6
#define SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_EPCA0_CONTROL_U32 \
   (SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_EPCA0_CONTROL_VALUE << SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_SHIFT)
// Service TIMER1L overflow data requests.
#define SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_TIMER1L_VALUE  7
#define SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_TIMER1L_U32 \
   (SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_TIMER1L_VALUE << SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_SHIFT)
// Service TIMER1H overflow data requests.
#define SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_TIMER1H_VALUE  8
#define SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_TIMER1H_U32 \
   (SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_TIMER1H_VALUE << SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_SHIFT)
// Service DMA0T1 rising edge data requests.
#define SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_DMA0T1_RISE_VALUE  9
#define SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_DMA0T1_RISE_U32 \
   (SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_DMA0T1_RISE_VALUE << SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_SHIFT)
// Service DMA0T1 falling edge data requests.
#define SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_DMA0T1_FALL_VALUE  10
#define SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_DMA0T1_FALL_U32 \
   (SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_DMA0T1_FALL_VALUE << SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_SHIFT)
// Unassigned.
#define SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_UNASSIGNED_VALUE  15
#define SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_UNASSIGNED_U32 \
   (SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_UNASSIGNED_VALUE << SI32_DMAXBAR_A_DMAXBAR1_CH9SEL_SHIFT)



typedef struct SI32_DMAXBAR_A_Struct
{
   struct SI32_DMAXBAR_A_DMAXBAR0_Struct           DMAXBAR0       ; // Base Address + 0x0
   volatile uint32_t                               DMAXBAR0_SET;
   volatile uint32_t                               DMAXBAR0_CLR;
   uint32_t                                        reserved0;
   struct SI32_DMAXBAR_A_DMAXBAR1_Struct           DMAXBAR1       ; // Base Address + 0x10
   volatile uint32_t                               DMAXBAR1_SET;
   volatile uint32_t                               DMAXBAR1_CLR;
   uint32_t                                        reserved1;
} SI32_DMAXBAR_A_Type;

#ifdef __cplusplus
}
#endif

#endif // __SI32_DMAXBAR_A_REGISTERS_H__

//-eof--------------------------------------------------------------------------

